# -*- coding: utf-8 -*-
"""
Created on Tue Jul 20 22:50:57 2021
@title: 06-4 for 迴圈 (for loop)
@author: shannon
"""

# 基本list Cart購物車 : 容器都可以使用for 一個個印出來
# =============================================================================
# cart = ('c', 'b', 'a')
# for i in cart: # in 後面要寫變數名稱 還是 原本樣子 Ex. (1,2,3) 也可以
#     print(i)
# 
# =============================================================================
# 基本的走訪字串, 集合, 字典 (還記得之前說過嗎? str也是容器的一種喔)

# =============================================================================
# name = "Shannon"
# print(type(name))
# for i in name:
#     print(i)
# =============================================================================

# Ctrl + S 儲存 
# 舉例: movie = {'末日Z站': [250, True, "殭屍", "20:00"], '歌喉讚': []}
# 訣竅dict.items() => key and value; dict.keys() => 只拿key; dict.values() => 只拿value
# 再試試看Dict: 只取Key
# =============================================================================
# testdict = {'one': 1, 'two': 2, 'three':3}
# for i in testdict: # 展示所有資料
#     print(i)
# 
# # 再試試看Dict: 只取Value
# testdict = {'one': 1, 'two': 2, 'three':3}
# for i in testdict.values():
#     print(i)
# 
# # 再試試看Dict: 同時 取Key 和 Value
# testdict = {'one': 1, 'two': 2, 'three':3}
# for item in testdict.items():
#     print(item)
#     print(type(item))
#     
# for key, value in testdict.items():  # 'one': 1
#     print(f"this is key => {key}, this is value => {value}")
# =============================================================================

    
# for迴圈: range使用方式 (一個input)
# =============================================================================
# for i in range(101):
#     print(i)
# =============================================================================

# for迴圈: range使用方式 (2個input) (parameter = param)
# =============================================================================
# sum = 0 
# for i in range(50,101): # 11-5=6/ 101-50=51 ("變數"要小於101, 變數每次都在+1)
#     sum = sum + i
#     print(f"加上{i}之後的sum，目前 sum 加總是 => {sum}")
# =============================================================================
# =============================================================================
# 
# sum = 0 
# for i in range(5,12): # 11-5=6/ 101-50=51 ("變數"要小於101, 變數每次都在+1)
#     if(i%2==1):# i / 2 = 商...餘 => 取餘數，如果 餘數=0 他就是偶數; 餘數=1 他就是奇數
#         sum = sum + i
#         print(f"加上{i}之後的sum，目前 sum 加總是 => {sum}")
# =============================================================================

# for迴圈: range使用方式 (3個input)
# =============================================================================
# sum = 0 
# for i in range(5,12): # 11-5=6/ 101-50=51 ("變數"要小於101, 變數每次都在+1)
#     if(i%2==1):# i / 2 = 商...餘 => 取餘數，如果 餘數=0 他就是偶數; 餘數=1 他就是奇數
#         sum = sum + i
#         print(f"加上{i}之後的sum，目前 sum 加總是 => {sum}")
# 
# =============================================================================

# for loop: 3 params 用法
# =============================================================================
# sum = 0 
# for i in range(0,100,10): # 11-5=6/ 101-50=51 ("變數"要小於101, 變數每次都在+1)
#     sum = sum + i
#     print(f"加上{i}之後的sum，目前 sum 加總是 => {sum}")
# 
# =============================================================================

# for迴圈: 也可以用break, continue, for...else...

# =============================================================================
# for i in range(0,11):
#     print(i)
#     if(i == 6):
#         print("我是6喔")
#         continue # 碰到continue or break 下面都不做了!! continue 直接回到頭, break 直接跳出for loop
#         print("hello, 怎麼都輪不到我") # 怎麼都輪不到我
# print("我不是for的一份子，but我會先乖乖等for做完")
# =============================================================================



# 九九乘法表: 很基本
# =============================================================================
# for i in range(1,10):
#     print(f"========我是{i}的一份子===========")
# 
#     for j in range(1,10): # 1 2 3 4 5 6 7 8 9
#         # print("我是j的一份子")
#         # print(f"this is i => {i}")
#         # print(f"this is j => {j}")
#         print(f"{i} * {j} = {i*j}")
#         
# print("=========Finish========")
# =============================================================================

# 雙層for 搭配 容器的用法
# print("我不屬於誰~")
# =============================================================================
# ppl = [['小名', '中學生', "2000,05,06", "0912345678"],['小花', '小學生', "2000,06,06", "0912345698"]]
# count = 1
# for person in ppl: # for person in [['小名', '中學生', "2000,05,06", "0912345678"],['小花', '小學生', "2000,06,06", "0912345698"]]
#     print(f"========第{count}個人的資料========")
#     
#     for secret in person: # for i in ['小名', '中學生', "2000,05,06", "0912345678"]:
#         print("個人資料是=>", secret)
#         
#     count += 1
# 
# member = [['小名', '中學生', "2000,05,06", "0912345678"],['小花', '小學生', "2000,06,06", "0912345698"]]
# for person in member: # for person in [['小名', '中學生', "2000,05,06", "0912345678"],['小花', '小學生', "2000,06,06", "0912345698"]]
#     print(person)
#     
#     for secret in person:
#         print(secret)
# =============================================================================
    
# 三角形: 老師都很愛教的用*印三角形 
# (課堂練習: 請幫我印出菱形)
# =============================================================================
# a = int(input("請輸入底部為幾個*"))
# e = a // 2 # 5//2 =2..1
# for i in range(e, -1, -1): # 2 -> 1 -> 0 
#     print(' '*i + '*'*(a-i*2) + ' '*i)
#     
# for i in range(1, e +1, 1): # (1,3,1)=> 1 2 x3
#     print(' '*i + '*'*(a-i*2) + ' '*i)
# =============================================================================


# BMI 結合for的概念  計算平均 + 加入容器 (資料結構) 

# Step1: 做一個空的容器 裝 BMI
allPeople = []

number = float(input("請輸入你要測幾次bmi=>")) # 10
count = 0.0
while True:
    # bmi
    weight = input("請輸入你的體重(kg)")
    height = input("請輸入你的身高(cm)")
    ## 算使用者的bmi: 體重/身高(m)平方
    if (weight.isdigit() and height.isdigit()): # 判斷是否為數字 使用 函式 變數.isdigit() = True False
        weight = float(weight) # 如果是True發現是數字，我才會開始計算BMI然後把變數轉成數字
        height = float(height) # 如果是True發現是數字，我才會開始計算BMI然後把變數轉成數字
        bmi = weight / ((height/100) ** 2) # pow((height/100), 2)
        # Step2: 把BMI append 到 allPeople最後一格
        allPeople.append(bmi)
        print(f"BMI是{bmi:+5.2f}") # 偷偷看一下目前BMI是多少 把她print出來
        ## 目前bmi狀態
        if (0 < bmi < 18.5): # 0 < bmi < 18.5: 過輕
            print("體重過輕")
        elif (bmi >= 18.5 and bmi < 24): # else if (判斷) : True and False = False
            print("你很健康") 
        elif (bmi >= 24 and bmi < 27): # True and False = False
            print("過重")
        elif (bmi >= 27 and bmi < 30): # True and True = True
            print("輕度肥胖")
        elif (bmi >= 30 and bmi <= 35):
            print("中度肥胖")
        elif (bmi >= 35):
            print("重度肥胖")
        else:
            print("你的數字可能有問題?")
    else:
        print("阿你這個根本不是數字吧!")  
    count = count + 1 # 目前跑的次數 會一直+1
    if(number == count):# count == number 目前的次數跟 使用者希望跑的次數有沒有一樣
        break
    else:
        continue
    # (count += 1) equal to (count = count + 1)

# Step3: 檢查一下目前長甚麼樣子
print(allPeople)

sum = 0
for i in allPeople:
    sum = sum + i
    print("全部的bmi加總 => ", sum) 
print(f"平均=> {sum/len(allPeople):5.2f}")


